# -*- olivetti-minimum-body-width: 120; -*-
#+title: Lauremacs

* About

- Developed in MacOS and Emacs 29.
- Done for my personal use, issues are welcome
- PRs only after issue discussions
- Focused in emacs-lisp, org-mode, elixir, typescript and haskell using LSP whenever it is possible¹
- Package managing using [[https://github.com/radian-software/straight.el][straight.el]]
- Files and project managing using [[https://github.com/emacs-helm/helm][helm]] and [[https://github.com/bbatsov/projectile][projectile]].


¹ This is a new version better organized from the `old-lauremacs` branch of this project. Check [[./CHANGELOG.org][Changelog]] to see which features are already implemented.
* Install
Clone this repo as your `.emacs.d` and that's it.

* Development organization

#+begin_src shell :exports both :results output 
  tree -L 2 --prune -I 'elpa|.git|#|backups|straight|*~'
#+end_src

#+RESULTS:
#+begin_example
.
├── CHANGELOG.org
├── Makefile
├── backlog.org
├── config
│   └── shortcuts.el
├── core
│   ├── consts.el
│   ├── core-packages.el
│   └── package-manager.el
├── early-init.el
├── eshell
│   └── history
├── init.el
├── lauremacs-libs
│   └── readme.org
├── readme.org
├── scripts
│   └── tangle-org.el
└── test
    ├── run-tests.el
    └── test-helpers.el

7 directories, 15 files
#+end_example

|---------------------+----------------------------------------------------------|
| load order          | description                                              |
|---------------------+----------------------------------------------------------|
| early-init.el       | sets interface and initial configs                       |
| init.el             | sets package managing and define the following loads     |
| core/               | some lisp definitions and configs used in all project    |
| internal-libs/      | small libraries written by me will be added to laod path |
| config/             | main configurations, mostly major and minor modes        |
| config/shortcuts.el | All commands used with the leader key                    |
| =~/.emacs=            | your personal configurations                             |
|---------------------+----------------------------------------------------------|

=~/.emacs= will be loaded if and only if =.emacs.d/lauremacs= does not exist.

* Test
=make test=

